app/Controllers/Home.php

    public function index()
    {
        // Ambil data untuk kategori iOS
        $produkIos = $this->produkModel
            ->select('produk.id, produk.nama_produk, produk.spesifikasi, produk.stok, thumbnail.gambar, harga.harga')
            ->join('thumbnail', 'thumbnail.id = produk.thumbnail_id', 'inner')
            ->join('harga', 'harga.produk_id = produk.id', 'inner')
            ->join('kategori', 'kategori.id = produk.kategori_id', 'inner')
            ->where('kategori.nama_kategori', 'iOS')
            ->findAll();

        // Ambil data untuk kategori Android
        $produkAndroid = $this->produkModel
            ->select('produk.id, produk.nama_produk, produk.spesifikasi, produk.stok, thumbnail.gambar, harga.harga')
            ->join('thumbnail', 'thumbnail.id = produk.thumbnail_id', 'inner')
            ->join('harga', 'harga.produk_id = produk.id', 'inner')
            ->join('kategori', 'kategori.id = produk.kategori_id', 'inner')
            ->where('kategori.nama_kategori', 'Android')
            ->findAll();

        // Ambil produk terbaru
        $produkTerbaru = $this->produkModel
            ->select('produk.id, produk.nama_produk, produk.spesifikasi, produk.stok, thumbnail.gambar, harga.harga')
            ->join('thumbnail', 'thumbnail.id = produk.thumbnail_id', 'inner')
            ->join('harga', 'harga.produk_id = produk.id', 'inner')
            ->orderBy('produk.id', 'DESC')
            ->limit(6)
            ->findAll();
---
SELECT `produk`.`id`, `produk`.`nama_produk`, `produk`.`spesifikasi`, `produk`.`stok`, `thumbnail`.`gambar`, `harga`.`harga`
FROM `produk`
INNER JOIN `thumbnail` ON `thumbnail`.`id` = `produk`.`thumbnail_id`
INNER JOIN `harga` ON `harga`.`produk_id` = `produk`.`id`
INNER JOIN `kategori` ON `kategori`.`id` = `produk`.`kategori_id`
WHERE `kategori`.`nama_kategori` = 'iOS'
SELECT `produk`.`id`, `produk`.`nama_produk`, `produk`.`spesifikasi`, `produk`.`stok`, `thumbnail`.`gambar`, `harga`.`harga`
FROM `produk`
INNER JOIN `thumbnail` ON `thumbnail`.`id` = `produk`.`thumbnail_id`
INNER JOIN `harga` ON `harga`.`produk_id` = `produk`.`id`
INNER JOIN `kategori` ON `kategori`.`id` = `produk`.`kategori_id`
WHERE `kategori`.`nama_kategori` = 'Android'
SELECT `produk`.`id`, `produk`.`nama_produk`, `produk`.`spesifikasi`, `produk`.`stok`, `thumbnail`.`gambar`, `harga`.`harga`
FROM `produk`
INNER JOIN `thumbnail` ON `thumbnail`.`id` = `produk`.`thumbnail_id`
INNER JOIN `harga` ON `harga`.`produk_id` = `produk`.`id`
ORDER BY `produk`.`id` DESC
 LIMIT 6